* Features
** Linking
   <<linking_to_headers>>

*** Regular items

    - Test 123
    - Test 123

*** Numbered items

1. Foo
2. Bar
3. Baz

** [[linking_to_headers][Linking to headers]]
*** Other links

- Link to website: [[https://github.com/200ok-ch/organice/]]

# Complex TODO with priority, active timestamp, link to an email and a tag
**** TODO [#B] <2019-05-02 Thu> Some Person [[mu4e:msgid:CAN6MX5o-i9koRnBXGOFQ-wLUhp82mGCwFSxo0b2i0+TROYNZkg@mail.gmail.com][Re: HÖCHENSCHWAND 05.Februar 2019]] :200ok:

*** Planning items

**** TODO I am scheduled
     SCHEDULED: <2019-09-22 Sun>
**** TODO I have deadline
     DEADLINE: <2019-09-22 Sun>
**** TODO I have a repeating schedule and a deadline
     DEADLINE: <2020-09-26 Sat> SCHEDULED: <2020-09-25 Fri +1y>
     :PROPERTIES:
     :LAST_REPEAT: [2019-09-22 Sun 11:27]
     :END:

     - State "DONE"       from "TODO"       [2019-09-22 Sun 11:27]

** Tables, clock reports, time entries, source blocks

   #+BEGIN: clocktable :maxlevel 25 :scope subtree :tstart "<2019-09-01 Sun>" :tend "<2019-10-01 Tue>" :indent nil :tcolumns 1 :timestamp nil :formula "$3=$2*150;t"
   #+CAPTION: Clock summary at [2019-09-22 Sun 11:21]
   | Headline            |   Time |        |
   |---------------------+--------+--------|
   | *Total time*        | *4:10* | 625.00 |
   |---------------------+--------+--------|
   | Tables              |   4:10 | 625.00 |
   | Something todo      |   2:05 | 312.50 |
   | Something else todo |   2:05 | 312.50 |
   #+TBLFM: $3=$2*150;t
   #+END:

   #+name: ok-timetable
   #+BEGIN_SRC elisp
   (ok-export-org-timetable "2019-03-04")
   #+END_SRC

*** TODO Something todo
    CLOCK: [2019-09-22 Sun 07:25]--[2019-09-22 Sun 07:30] =>  0:05
    CLOCK: [2019-09-22 Sun 09:20]--[2019-09-22 Sun 11:20] =>  2:00

*** TODO Something else todo
    CLOCK: [2019-09-21 Sat 07:25]--[2019-09-21 Sat 07:30] =>  0:05
    CLOCK: [2019-09-21 Sat 09:20]--[2019-09-21 Sat 11:20] =>  2:00

** Prose

"Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do
eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad
minim veniam, quis nostrud exercitation ullamco laboris nisi ut
aliquip ex ea commodo consequat. Duis aute irure dolor in
reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla
pariatur. Excepteur sint occaecat cupidatat non proident, sunt in
culpa qui officia deserunt mollit anim id est laborum."

Section 1.10.32 of "de Finibus Bonorum et Malorum", written by Cicero
in 45 BC

"Sed ut perspiciatis unde omnis iste natus error sit voluptatem
accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae
ab illo inventore veritatis et quasi architecto beatae vitae dicta
sunt explicabo. Nemo enim ipsam voluptatem quia voluptas sit
aspernatur aut odit aut fugit, sed quia consequuntur magni dolores eos
qui ratione voluptatem sequi nesciunt. Neque porro quisquam est, qui
dolorem ipsum quia dolor sit amet, consectetur, adipisci velit, sed
quia non numquam eius modi tempora incidunt ut labore et dolore magnam
aliquam quaerat voluptatem. Ut enim ad minima veniam, quis nostrum
exercitationem ullam corporis suscipit laboriosam, nisi ut aliquid ex
ea commodi consequatur? Quis autem vel eum iure reprehenderit qui in
ea voluptate velit esse quam nihil molestiae consequatur, vel illum
qui dolorem eum fugiat quo voluptas nulla pariatur?"

** Testing
** Something with logbook
   :LOGBOOK:
   CLOCK: [2019-11-13 Wed 13:12]--[2019-11-13 Wed 13:12] =>  0:00
   CLOCK: [2019-11-11 Mon 13:12]--[2019-11-12 Tue 13:12] => 24:00
   CLOCK: [2019-10-13 Sun 12:15]--[2019-10-13 Sun 14:12] =>  1:57
   :END:
** A messy headline with trailing whitespace                    

organice's parser is build on the premise that it should not produce a
diff on users Org files. Lets say there's a new user with a big file.
She has loads of trailing whitespace in headers. She opens the file in
organice, makes a one byte change and looks at the diff. She should
only find the one byte change. Or, The one byte change plus trimmed
whitespace on the headline she made the change to. She shouldn't have
her file 'messed with', even if we think it's cleaner.

NB: organice is opinionated about helping users, though. Hence, it does trim whitespace when entered in capture templates.
